#include <stm32f10x.h>  
#include "led.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//Mini STM32开发板
//LED驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2010/5/27
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 正点原子 2009-2019
//All rights reserved											  
////////////////////////////////////////////////////////////////////////////////// 	   

//初始化Pc6为输出口.并使能这两个口的时钟		    
//LED IO初始化
void LED_Init(void)
{
//	RCC->APB2ENR|=1<<2;    //使能PORTA时钟	   	 
	RCC->APB2ENR|=1<<4;    //使能PORTC时钟	
	   	 

											  
	GPIOC->CRL&=0XF0FFFFFF;
	GPIOC->CRL|=0X03000000;//PC6推挽输出
	GPIOC->ODR|=1<<6;      //PC6输出高 
}


	   



